tests/fixtures/ndax_synthetic_ledger_v1.csv

ASSET,ASSET_CLASS,AMOUNT,BALANCE,TYPE,TX_ID,DATE
CAD,FIAT,50,50,DEPOSIT,10001,2025-02-27T15:46:17.000Z
BTC,CRYPTO,0.0004,0.0004,TRADE,10002,2025-02-27T15:48:04.000Z
CAD,FIAT,-49.676,0.324,TRADE,10002,2025-02-27T15:48:04.000Z
BTC,CRYPTO,0,0.0004,TRADE / FEE,10002,2025-02-27T15:48:04.000Z
CAD,FIAT,5000,5000.324,DEPOSIT,10003,2025-03-01T09:00:00.000Z
ETH,CRYPTO,0.5,0.5,TRADE,10004,2025-03-06T10:30:00.000Z
CAD,FIAT,-1150.00,3850.324,TRADE,10004,2025-03-06T10:30:00.000Z
ETH,CRYPTO,-0.000007,0.499993,TRADE / FEE,10004,2025-03-06T10:30:00.000Z
BTC,CRYPTO,0.0250,0.0254,TRADE,10005,2025-03-10T14:00:00.000Z
CAD,FIAT,-3175.00,675.324,TRADE,10005,2025-03-10T14:00:00.000Z
BTC,CRYPTO,-0.000025,0.025375,TRADE / FEE,10005,2025-03-10T14:00:00.000Z
ETH,CRYPTO,0.00412,0.504113,STAKING / REWARD,10006,2025-03-25T11:00:00.000Z
ETH,CRYPTO,-0.3,0.204113,TRADE,10007,2025-04-01T09:15:00.000Z
CAD,FIAT,690.00,1365.324,TRADE,10007,2025-04-01T09:15:00.000Z
CAD,FIAT,-0.1184436,1365.2055564,TRADE / FEE,10007,2025-04-01T09:15:00.000Z
BTC,CRYPTO,-0.0150,0.010375,WITHDRAW,10008,2025-04-05T13:30:00.000Z
BTC,CRYPTO,-0.00003,0.010345,WITHDRAW / FEE,10008,2025-04-05T13:30:00.000Z
ETH,CRYPTO,-0.2,0.004113,WITHDRAW,10009,2025-04-10T11:00:00.000Z
ETH,CRYPTO,-0.00210,0.002013,WITHDRAW / FEE,10009,2025-04-10T11:00:00.000Z
BTC,CRYPTO,0.00000010,0.010345,DUST / IN,10010,2025-04-15T16:45:00.000Z
ETH,CRYPTO,-0.00000043,0.00201257,DUST / OUT,10010,2025-04-15T16:45:00.000Z
BTC,CRYPTO,0.00001691,0.01036157,DUST / IN,10011,2025-05-01T10:00:00.000Z
SOL,CRYPTO,-0.011182,0,DUST / OUT,10011,2025-05-01T10:00:00.000Z
BTC,CRYPTO,-0.00000034,0.01036123,DUST / FEE,10011,2025-05-01T10:00:00.000Z
SOL,CRYPTO,0.25,0.25,DEPOSIT,10012,2025-05-02T09:00:00.000Z
SOL,CRYPTO,-0.2395,0.0105,WITHDRAW,10013,2025-05-03T11:00:00.000Z
SOL,CRYPTO,-0.001,0.0095,WITHDRAW / FEE,10013,2025-05-03T11:00:00.000Z
ETH,CRYPTO,-0.1,0,STAKING / DEPOSIT,10014,2025-05-05T08:00:00.000Z
ETH,CRYPTO,-0.1,0.1,STAKING / REFUND,10015,2025-05-06T08:00:00.000Z
SOL,CRYPTO,0,0.0095,DEPOSIT,10016,2025-05-07T09:00:00.000Z
